---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures
source: html/c3a815b9-3dbf-333b-626d-cca41e135572.htm
---
# BuiltInFailures.KeyBasedTreeFileFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.